PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_eddsa.c
    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointMulAdd
****************************************************************************//**
*
* Edward 25519 Elliptic curve point multiply-Add in GF(p).
*
* R = s*P + h*Q
*
* \param base
* The pointer to a Crypto instance.
*
* \param p_x
* Register index for affine X coordinate of point.
*
* \param p_y
* Register index for affine Y coordinate of point.
*
* \param s
* Register index for multiplication value.
*
* \param q_x
* Register index for affine X coordinate of point.
*
* \param q_y
* Register index for affine Y coordinate of point.
*
* \param h
* Register index for multiplication value.
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointMulAdd(CRYPTO_Type *base, cy_stc_crypto_edw_dp_type *edwDp,
        uint32_t p_x, uint32_t p_y, uint32_t s,
        uint32_t q_x, uint32_t q_y, uint32_t h,
        uint32_t bitsize)
{
    /* Note: Pre conditions 0 < (px,py)(qx,qy) < N-1 */
    /* Do not use all arg REG (5,7,8,9,11,12), also on V1 reg2 is modified by mem ops */
    uint32_t p_z     = 1u;
    uint32_t my_s    = 3u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_s, s);

    /* load prime defining the curve as well as the barrett coefficient. */
    /* VR_P and VR_BARRETT_U are "globally" defined in cy_crypto_core_ecc.h */
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->prime), bitsize);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, edwDp->barret_psize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_p), edwDp->barret_psize);


    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_z, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* init point->z to 1. */
    CY_CRYPTO_VU_SET_TO_ONE(base, p_z);

    /*sB = point_mul(s, G)*/
    tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, p_x, p_y, my_s, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /*hA = point_mul(h, A)*/
    tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, q_x, q_y, h, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* R = point_add(sB, hA) */
    /* RFC Sec 5.1.7 Check the group equation [S]B = R + [k]A'.  It's sufficient.
       We perform fast single-signature verification by computing R = [s]B + [-k]A'. compressing 'R' and comparing with Sig[R] without
       decompressing it.
    */
    tmpResult = Cy_Crypto_Core_ED25519Add(base, edwDp, p_x, p_y, p_z, q_x, q_y, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Inverse transform */
    Cy_Crypto_Core_Vu_WaitForComplete(base);
    tmpResult = Cy_Crypto_Core_ED25519InvTransform(base, p_x, p_y, p_z, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_Vu_WaitForComplete(base);
    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_z) | CY_CRYPTO_VU_REG_BIT(VR_P) | CY_CRYPTO_VU_REG_BIT(VR_BARRETT));
    CY_CRYPTO_VU_POP_REG(base);

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointMul
****************************************************************************//**
*
* Edward 25519 Elliptic curve point multiplication in GF(p).
*
* \param base
* The pointer to a Crypto instance.
*
* \param p_x
* Register index for affine X coordinate of base point.
*
* \param p_y
* Register index for affine Y coordinate of base point.
*
* \param p_d
* Register index for multiplication value.
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointMul(CRYPTO_Type *base, cy_stc_crypto_edw_dp_type *edwDp, uint32_t p_x, uint32_t p_y, uint32_t p_d, uint32_t bitsize)
{
    /* Note: Pre conditions 0 < px, py < p-1 (consider randomizing the base point)*/

    uint32_t i;
    uint32_t status;
    uint32_t carry;
    uint16_t clsame;
    uint32_t loop;

    uint32_t clr     = 5u;
    uint32_t t       = 6u;
    uint32_t my_s_x  = 7u;
    uint32_t my_s_y  = 8u;
    uint32_t my_s_z  = 9u;
    uint32_t my_t_x  = 10u;
    uint32_t my_t_y  = 11u;
    uint32_t my_d    = 12u;
    uint32_t r_p_x, r_p_y, r_p_d;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_SAVE_REG(base, p_x, &r_p_x);
    CY_CRYPTO_VU_SAVE_REG(base, p_y, &r_p_y);
    CY_CRYPTO_VU_SAVE_REG(base, p_d, &r_p_d);

    CY_CRYPTO_VU_RESTORE_REG(base, my_s_x, r_p_x);
    CY_CRYPTO_VU_RESTORE_REG(base, my_s_y, r_p_y);
    CY_CRYPTO_VU_RESTORE_REG(base, my_d, r_p_d);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, clr, bitsize + 1u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_s_z, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_t_x, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_t_y, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* load prime defining the curve as well as the barrett coefficient. */
    /* VR_P and VR_BARRETT_U are "globally" defined in cy_crypto_core_ecc.h */
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->prime), bitsize);

