PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_eddsa.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, edwDp->barret_psize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_p), edwDp->barret_psize);


    CY_CRYPTO_VU_MOV(base, my_t_x, my_s_x);
    CY_CRYPTO_VU_MOV(base, my_t_y, my_s_y);

    /* init point->z to 1. */
    CY_CRYPTO_VU_SET_TO_ONE(base, my_s_z);

    /* EC scalar multiplication (irregular) operation. */
    CY_CRYPTO_VU_SET_TO_ZERO(base, clr);
    CY_CRYPTO_VU_CLSAME(base, t, my_d, clr);

    /* This is needed, otherwise clsame is wrong */
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    clsame = Cy_Crypto_Core_Vu_RegDataPtrRead(base, t);

    CY_CRYPTO_VU_LSL(base, my_d, my_d, t);   /* Get rid of leading '0's */
    CY_CRYPTO_VU_LSL1(base, my_d, my_d);     /* Get rid of leading '1' */

    /* Binary left-to-right algorithm
    * Perform point addition and point doubling to implement scalar multiplication
    * Scan the bits of the scalar from left to right; perform point doubling for each bit,
    * and perform point addition when the bit is set.
    * Carry set if current bit is equal to 1 (hence, perform point addition - point
    * doubling is always performed)
    */
    if (bitsize >= clsame)
    {
        loop = (uint32_t)(bitsize - clsame);
    }
    else
    {
        return CY_CRYPTO_HW_ERROR;
    }

    for (i = 0; i < (loop); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform point addition - point
        * doubling is always performed)
        */
        CY_CRYPTO_VU_LSL1(base, my_d, my_d);
        status = Cy_Crypto_Core_Vu_StatusRead(base);

        carry = status & CY_CRYPTO_VU_STATUS_CARRY_BIT;

        tmpResult = Cy_Crypto_Core_ED25519Double(base, edwDp, my_s_x, my_s_y, my_s_z, bitsize);

        if (CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (carry != 0u)
        {
            tmpResult = Cy_Crypto_Core_ED25519Add(base, edwDp, my_s_x, my_s_y, my_s_z, my_t_x, my_t_y, bitsize);

            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
        }
    }
    Cy_Crypto_Core_Vu_WaitForComplete(base);
    /* Inverse transform */
    tmpResult = Cy_Crypto_Core_ED25519InvTransform(base, my_s_x, my_s_y, my_s_z, bitsize);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_Vu_WaitForComplete(base);
    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(my_s_z) | CY_CRYPTO_VU_REG_BIT(my_t_x) |
                          CY_CRYPTO_VU_REG_BIT(my_t_y) | CY_CRYPTO_VU_REG_BIT(t) |
                          CY_CRYPTO_VU_REG_BIT(VR_P)   | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                          CY_CRYPTO_VU_REG_BIT(clr));


    CY_CRYPTO_VU_POP_REG(base);

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointMultiplication
****************************************************************************//**
*
* Edwards 25519 elliptic curve point multiplication in GF(p).
*
* When D-Cache is enabled parameters ecpGX,ecpGY,ecpD,ecpQX and ecpQY must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param curveID
* See \ref cy_en_crypto_ecc_curve_id_t.
*
* \param ecpGX
* X coordinate of base point.
*
* \param ecpGY
* Y coordinate of base point.
*
* \param ecpD
* multiplication scalar value.
*
* \param ecpQX
* X coordinate of result point.
*
* \param ecpQY
* Y coordinate of result point.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointMultiplication(CRYPTO_Type *base,
        cy_en_crypto_ecc_curve_id_t curveID,
        const uint8_t *ecpGX,
        const uint8_t *ecpGY,
        const uint8_t *ecpD,
        uint8_t *ecpQX,
        uint8_t *ecpQY)
{
    cy_stc_crypto_edw_dp_type edw_Dp;
    cy_stc_crypto_edw_dp_type *edwDp = &edw_Dp;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, curveID))
    {
        uint32_t bitsize;

        bitsize   = edwDp->size;
        tmpResult = CY_CRYPTO_BAD_PARAMS;

        if ((NULL != ecpGX) && (NULL != ecpGY) && (NULL != ecpD) && (NULL != ecpQX) && (NULL != ecpQY))
        {
            uint8_t *ecpGXRemap;
            uint8_t *ecpGYRemap;
            uint8_t *ecpDRemap;
            uint8_t *ecpQXRemap;
            uint8_t *ecpQYRemap;

            ecpGXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpGX);
            ecpGYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpGY);
            ecpDRemap  = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpD);
            ecpQXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpQX);
            ecpQYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpQY);

            /* Public parameters and characteristics of elliptic curve */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_D, bitsize + 1u);       /* Scalar factor */
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_X, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_Y, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_X, ecpGXRemap, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_Y, ecpGYRemap, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_D, ecpDRemap, bitsize + 1u);

            /* ECC calculation: d * G mod p */
            tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, VR_S_X, VR_S_Y, VR_D, bitsize);

            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /* Get result P = (X,Y) = d.G from Ed25519 scalar multiplication */
            Cy_Crypto_Core_Vu_GetMemValue(base, ecpQXRemap, VR_S_X, bitsize);
            Cy_Crypto_Core_Vu_GetMemValue(base, ecpQYRemap, VR_S_Y, bitsize);

            Cy_Crypto_Core_Vu_WaitForComplete(base);
            /* Free memory */
            CY_CRYPTO_VU_FREE_MEM(base,
                                  CY_CRYPTO_VU_REG_BIT(VR_S_Y) |
                                  CY_CRYPTO_VU_REG_BIT(VR_S_X) |
                                  CY_CRYPTO_VU_REG_BIT(VR_D));

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

