PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_eddsa.c
            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                uint32_t p_sha  = 4u;
                uint32_t p_temp = 5u;
                uint32_t p_r    = 6u;
                uint32_t p_s    = 7u;
                uint32_t p_x    = 8u;
                uint32_t p_y    = 9u;

                uint8_t *digest;
                uint8_t *scalar;
                uint8_t *prefix;
                uint8_t *pubkey_x;
                uint8_t *pubkey_y;
                uint8_t *r_x;
                uint8_t *r_y;
                uint8_t pr_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_ECC_ED25519_BYTE_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
                uint8_t *pr = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(pr_t);

                /*Curve Order*/
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->order), bitsize);
                /* Barret coef for Order*/
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, edwDp->barret_osize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_o), edwDp->barret_osize);
                /* Gx co-ordinate */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_X, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_X, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gx), bitsize);
                /* Gy co-ordinate */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_Y, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_Y, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gy), bitsize + 1u);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_r, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_MemSet(base, (void*)Cy_Crypto_Core_Vu_RegMemPointer(base, p_r), (uint8_t)0, (uint16_t)bytesize);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_s, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_sha, (CY_CRYPTO_SHA512_HASH_SIZE * 8u));
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                digest = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_sha);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_temp, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_x, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_x, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gx), bitsize);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_y, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_y, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gy), bitsize + 1u);

                mallocMask = CY_CRYPTO_VU_REG_BIT(VR_P)   | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                             CY_CRYPTO_VU_REG_BIT(VR_S_X) | CY_CRYPTO_VU_REG_BIT(VR_S_Y) |
                             CY_CRYPTO_VU_REG_BIT(p_r)    | CY_CRYPTO_VU_REG_BIT(p_s) |
                             CY_CRYPTO_VU_REG_BIT(p_x)    | CY_CRYPTO_VU_REG_BIT(p_y) |
                             CY_CRYPTO_VU_REG_BIT(p_sha)  | CY_CRYPTO_VU_REG_BIT(p_temp);

                /*step1: Compute secret scalar 's' and prefix*/
                /*SHA expects big-endian*/
                tmpResult = Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)keyKRemap, bytesize);
                if (CY_CRYPTO_SUCCESS == tmpResult)
                {
                    tmpResult = Cy_Crypto_Core_Sha_Finish(base, shaHashState, digest);
                }
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /*Prune the buffer: The lowest three bits of the first octet are cleared, the highest bit of the last octet is cleared,
                and the second highest bit of the last octet is set.*/
                digest[0]  &= ~((uint8_t)0x7);
                digest[31] &= ~((uint8_t)0x80);
                digest[31] |= (uint8_t)0x40;

                /*s = digest[0-31] prefix = digest[32-63]*/
                scalar = &digest[0];
                prefix = &digest[32];
                /* Note: Point mul does in-place use for p_s which clears it, REG use needs to be re-looked to optimize*/
                Cy_Crypto_Core_Vu_SetMemValue(base, p_s, (uint8_t const*)scalar, ((CY_CRYPTO_SHA512_HASH_SIZE * 8u) >> 1u));
                /* generate pubKey A = [s]B */
                tmpResult =  Cy_Crypto_Core_ED25519_PointMul(base, edwDp, VR_S_X, VR_S_Y, p_s, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_s, (uint8_t const*)scalar, ((CY_CRYPTO_SHA512_HASH_SIZE * 8u) >> 1u));

                pubkey_x = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, VR_S_X);
                pubkey_y = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, VR_S_Y);

                /* step2: 'r' computation */
                (void)Cy_Crypto_Core_Sha_Start(base, shaHashState);
                /* EDDSA sig mode as per 5.1 RFC 8032 */
                if (sigType != CY_CRYPTO_EDDSA_PURE)
                {
                    Cy_Crypto_Core_ED25519_dom2_ctx(base, sigType, sigctx, sigctx_len, shaHashState);
                }

                /*update prefix and input hash */
                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)prefix, (CY_CRYPTO_SHA512_HASH_SIZE >> 1u));
                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)hashPtrRemap, hashlen);
                (void)Cy_Crypto_Core_Sha_Finish(base, shaHashState, digest);

                /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
                if (CY_CRYPTO_SUCCESS != Cy_Crypto_Core_EDDSA_Bar_MulRed(base, p_r, p_sha, bitsize))
                {
                    return CY_CRYPTO_BAD_PARAMS;
                }
                /* Note: Point mul does in-place use for p_r which clears it, REG use needs to be re-looked to optimize*/
                Cy_Crypto_Core_Vu_GetMemValue(base, (uint8_t*)pr, p_r, bitsize);
                /* Step 3 */
                tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, p_x, p_y, p_r, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_r, (uint8_t const*)pr, ((CY_CRYPTO_SHA512_HASH_SIZE * 8u) >> 1u));

                /*Note: key encode/decode can be a separate function helps verify */
                /* encode point: From RFC 5.1.2, we shall copy LSB of x to the MSB of y */
                /* Test p_x for odd */
                r_x = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_x);
                r_y = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_y);
                if ((bool)(((uint8_t *)r_x)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)r_y)[31] = ((uint8_t*)r_y)[31] | (uint8_t)0x80;
                }

                /* Copy r to sig result */
                Cy_Crypto_Core_Vu_GetMemValue(base, &sigPtrRemap[0], p_y, bitsize);

                /* Step4: 's' computation */
                (void)Cy_Crypto_Core_Sha_Start(base, shaHashState);
                /* EDDSA sig mode as per 5.1 RFC 8032 */
                if (sigType != CY_CRYPTO_EDDSA_PURE)
                {
                    Cy_Crypto_Core_ED25519_dom2_ctx(base, sigType, sigctx, sigctx_len, shaHashState);
                }

                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)r_y, bytesize);
                /*Note: key encode/decode can be a separate function */
                /* encode point: From RFC 5.1.2, we shall copy LSB of x to the MSB of y */
                if ((bool)(((uint8_t *)pubkey_x)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)pubkey_y)[31] = ((uint8_t*)pubkey_y)[31] | (uint8_t)0x80;
                }

                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)pubkey_y, bytesize);
                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)hashPtrRemap, hashlen);
                (void)Cy_Crypto_Core_Sha_Finish(base, shaHashState, digest);

