PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_eddsa.c
                /* Barret coef for Order*/
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, edwDp->barret_osize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_o), edwDp->barret_osize);
                /* Gx co-ordinate */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_X, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_X, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gx), bitsize);
                /* Gy co-ordinate */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_Y, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_Y, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gy), bitsize + 1u);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_sha, (CY_CRYPTO_SHA512_HASH_SIZE * 8u));
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                digest = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_sha);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_temp, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_x, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_x, (uint8_t const *)pubKeyXRemap, bitsize + 1u);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_y, bitsize + 1u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_y, (uint8_t const *)pubKeyYRemap, bitsize + 1u);

                mallocMask = CY_CRYPTO_VU_REG_BIT(VR_P)   | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                             CY_CRYPTO_VU_REG_BIT(VR_S_X) | CY_CRYPTO_VU_REG_BIT(VR_S_Y) |
                             CY_CRYPTO_VU_REG_BIT(p_r)    | CY_CRYPTO_VU_REG_BIT(p_s) |
                             CY_CRYPTO_VU_REG_BIT(p_x)    | CY_CRYPTO_VU_REG_BIT(p_y) |
                             CY_CRYPTO_VU_REG_BIT(p_sha)  | CY_CRYPTO_VU_REG_BIT(p_temp);

                /* step1 */
                /*SHA expects big-endian*/
                if (sigType != CY_CRYPTO_EDDSA_PURE)
                {
                    Cy_Crypto_Core_ED25519_dom2_ctx(base, sigType, sigctx, sigctx_len, shaHashState);
                }

                /* step2: h = sha512(Rs + public + msg) mod N */
                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)sig_r, bytesize);
                /* compress public key */
                pubkey_x = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_x);
                pubkey_y = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_y);

                if ((bool)(((uint8_t *)pubkey_x)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)pubkey_y)[31] |= (uint8_t)0x80;
                }
                /* interpret as little-endian */
                (void)Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)pubkey_y, bytesize);
                /* For EDDSA_PREHASH, buf should contain the SHA512 hash. It contains the whole message otherwise */
                tmpResult = Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)hashPtrRemap, hashlen);
                if (CY_CRYPTO_SUCCESS == tmpResult)
                {
                    tmpResult = Cy_Crypto_Core_Sha_Finish(base, shaHashState, digest);
                    if (CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }
                }

                /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
                if (CY_CRYPTO_SUCCESS != Cy_Crypto_Core_EDDSA_Bar_MulRed(base, p_temp, p_sha, bitsize))
                {
                    return CY_CRYPTO_BAD_PARAMS;
                }
                /* Step 3 */
                /* We perform fast single-signature verification by compressing sB-hA and comparing with r without decompressing it */
                ((uint8_t*)pubkey_y)[31] &= (uint8_t)0x7F;

                CY_CRYPTO_VU_SUB(base, p_temp, VR_P, p_temp);
                /* R = sG + hA */
                tmpResult =  Cy_Crypto_Core_ED25519_PointMulAdd(base, edwDp, VR_S_X, VR_S_Y, p_s, p_x, p_y, p_temp, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* Compress R (we re-use pubkey_x & y)*/
                pubkey_x = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, VR_S_X);
                pubkey_y = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, VR_S_Y);
                if ((bool)(((uint8_t *)pubkey_x)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)pubkey_y)[31] |= (uint8_t)0x80;
                }
                /* since its compressed we are free to compare with r without decompressing it */
                if (Cy_Crypto_Core_Vu_IsRegEqual(base, VR_S_Y, p_r))
                {
                    *stat = CY_ED25519SIG_VERIFY_PASS;
                }
                else
                {
                    *stat = CY_ED25519SIG_VERIFY_FAIL;
                }
                /* Free all mem allocations */
                CY_CRYPTO_VU_FREE_MEM(base, mallocMask);
                (void)Cy_Crypto_Core_Sha_Free(base, shaHashState);
            }
        }
    }

    return (tmpResult);
}
#endif /* defined(CY_CRYPTO_CFG_EDDSA_VERIFY_C) */
#endif /* (CY_CRYPTO_CFG_EDDSA_C) || defined(CY_CRYPTO_CFG_EC25519_C) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */

/* [] END OF FILE */
